CREATE TABLE `memberinfo` (
  `id` varchar(100) NOT NULL,
  `pw` varchar(100) DEFAULT NULL,
  `pname` varchar(100) DEFAULT NULL,
  `birth` varchar(100) DEFAULT NULL,
  `gender` varchar(100) DEFAULT NULL,
  `phone` varchar(100) DEFAULT NULL,
  `email` varchar(100) DEFAULT NULL,
  `reg_date` datetime DEFAULT NULL,
  `kind` varchar(100) DEFAULT NULL,
  `ban` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`id`)
)

INSERT INTO muggle_db.memberinfo (id,pw,pname,birth,gender,phone,email,reg_date,kind,ban) VALUES
    ('11111111','1111','십이다','2001-01-01','여자','010-3219-3556','11111111@daum.com','2021-12-28 20:45:06','관리자',''),
    ('11111313','1111','오병철','19950514',NULL,'01093343427','dfhjlsj@namver','2022-01-01 17:23:10','선생','성우과정'),
    ('1111222','1111111111','이름이에요','1988-01-01','남자','(SKT)010-1111-1111','emaildfdsfd@naver.com','2021-12-28 23:46:39','학생','호흡과 발성'),
    ('1232131','1111','이이이','1988-12-05','남자','(SKT)010-2222-2222','111111111111111111@naver.com','2021-12-28 22:02:56','학생','호흡과 발성'),
    ('1323','11111111','전성윤','1993-10-10','여자','(SKT)010-1111-1111','powerfsdfsdd@naver.com','2021-12-30 18:05:29','선생','호흡과 발성'),
    ('231213131','22222222','전성윤','1988-01-01','여자','(SKT)010-1111-1111','pdfsdfsdf@naver.com','2021-12-30 18:00:00','학생','성우연기'),
    ('32321231','2222','오병철','1985-12-07','남자','(SKT)010-1111-1111','1111dfsdf@naver.com','2021-12-28 22:09:01','학생','성우연기'),
    ('3333','1111','아아아아','1998-05-05','남자','(SKT)010-1111-1111','powerman@naver.com','2021-12-28 22:13:23','학생','성우연기'),
    ('admin','1111','관리자','2021-12-31',NULL,NULL,NULL,NULL,'관리자',NULL),
    ('andy1234','1111','일이다','1993-12-11','여자','010-1111-1111','andy1234@naver.com','2021-12-28 20:45:06','학생','성우연기');
INSERT INTO muggle_db.memberinfo (id,pw,pname,birth,gender,phone,email,reg_date,kind,ban) VALUES
    ('bee2311','1111','이다','1991-01-01','남자','010-2222-2222','bee2311@daum.com','2021-12-28 20:45:06','학생','성우연기'),
    ('ddd1211','11111111','전성윤','1993-10-10','남자','(KT)010-1111-1111','powermfdfsd@naver.com','2021-12-30 17:58:36','학생','성우연기'),
    ('ddddddd','1111','십육이다','1998-12-11','여자','010-6567-8865','ddddddd@naver.com','2021-12-28 20:45:06','학생','성우연기'),
    ('ddddddds','11111111','정정여','1993-10-10','여자','(SKT)010-1111-1111','powerman1122@daum.net','2021-12-29 00:11:33','학생','성우연기'),
    ('dfsdf','1111','십사다','2010-02-18','남자','010-4454-5666','dfsdf@daum.com','2021-12-28 20:45:06','학생','성우연기'),
    ('dfsdfsdf','1111','십이다','2001-01-01','남자','010-1010-1010','dfsdfsdf@daum.com','2021-12-28 20:45:06','학생','성우연기'),
    ('dsf11','11111111','전성윤','1988-01-01','여자','(SKT)010-1111-1111','powerman22@naver.com','2021-12-30 18:30:12','학생','성우연기'),
    ('ekvin123','1111','삼이다','1990-05-11','여자','010-3333-3333','ekvin123@naver.com','2021-12-28 20:45:06','학생','성우연기'),
    ('flsdjfklsj','1111','돼지고기','1955-07-03','남자','(SKT)010-1111-1111','dfsdfsdf@naver.com','2021-12-28 22:12:16','학생','호흡과 발성'),
    ('ggggggg','1111','십칠이다','1997-10-10','남자','010-1651-9855','ggggggg@daum.com','2021-12-28 20:45:06','학생','호흡과 발성');
INSERT INTO muggle_db.memberinfo (id,pw,pname,birth,gender,phone,email,reg_date,kind,ban) VALUES
    ('kingofcode','1111','전성윤','1988-01-01','남자','(SKT)010-2222-2222','powerman@naver.com','2021-12-28 20:46:45','학생','호흡과 발성'),
    ('liekek22','1111','구이다','2002-02-02','여자','010-9999-9999','liekek22@naver.com','2021-12-28 20:45:06','학생','호흡과 발성'),
    ('love3333','1111','칠이다','1998-05-14','여자','010-7777-7777','love3333@naver.com','2021-12-28 20:45:06','학생','호흡과 발성'),
    ('orange2','1111','육이다','1995-02-25','남자','010-6666-6666','orange2@naver.com','2021-12-28 20:45:06','학생','호흡과 발성'),
    ('person2','1111','오이다','1990-08-14','여자','010-5555-5555','person2@daum.com','2021-12-28 20:45:06','학생','호흡과 발성'),
    ('solider1','1111','사이다','1991-06-04','남자','010-4444-4444','solider1@naver.com','2021-12-28 20:45:06','학생','호흡과 발성'),
    ('tankman','1111','팔이다','2000-01-01','남자','010-8888-8888','tankman@daum.com','2021-12-28 20:45:06','학생','호흡과 발성'),
    ('teacherTest33','1111','이름','19930514',NULL,'01093343427','dfhjlsj@namver','2022-01-01 17:51:01','선생','성우과정'),
    ('zzzz','1111','십오다','1999-09-01','남자','010-8888-4454','zzzz@naver.com','2021-12-28 20:45:06','학생','호흡과 발성');