package io_p;

import java.io.ByteArrayInputStream;

/*               신호               정보
   <----------         ------------>
bit                           byte
                   BCD      ASCII      EBCDIC
1   2   3   4   5   6      7         8

2   4   8   16   32   64      128         256
--------------------------------------------------------------------------
0   00   000   0~9      a~z 26   +특수기호      0 : 양수
1   01   001         A~Z 26            1 : 음수
   10   010         0~9 10
   11   011         ---------
      100            62
      101
      110
      111

byte               short
0 000 0000   0         0 000 0000   0000 0000   0
0 000 0001   1
0 000 0010   2
0 000 0011   3
0 000 0100   4
0 000 0101   5
0 000 0110   6
0 000 0111   7

0 000 1000   8
0 000 1001   9
0 000 1010   10
0 000 1011   11
0 000 1100   12
0 000 1101   13
0 000 1110   14
0 000 1111   15
...
0 111 1101   125
0 111 1110   126
0 111 1111   127          0 000 0000   0111 1111   127

1 000 0000 -128         0 000 0000   1000 0000   128
1 000 0001 -127         0 000 0000   1000 0001   129
1 000 0010 -126         0 000 0000   1000 0010   130
1 000 0011 -125         0 000 0000   1000 0011   131
1 000 0100 -124         0 000 0000   1000 0100   132
... 
1 111 1101   -3         0 000 0000   1111 1101   253
1 111 1110   -2         0 000 0000   1111 1110   254
1 111 1111   -1          0 000 0000   1111 1111   255

0 000 0000   0          0 000 0001   0000 0000   256
*/


public class ByteInputMain {

   public static void main(String[] args) throws Exception {
      byte [] arr = {11,-1,45,23,78,-123,1,123,-85,67,-9,0,1};
      
      ByteArrayInputStream bis = new ByteArrayInputStream(arr);
      
      //  bis.read()  -1 :> stream 에 더이상의 값이 없다
      /*
      while(true) {
         System.out.println(bis.read());
         Thread.sleep(10);
      
      }
      */
      
      int data;
      while(true) {
         
         data = bis.read();
         
         if(data==-1) {
            break;
         }
         System.out.println(data+":"+(byte)data);
      }
      
      bis.close();

   }

}